wright0418/Richlink_Smart_Box-M482S-/SampleCode/RL_SPORT/ble.c
#include <stdarg.h>
#if defined(__has_include)
#if __has_include(<stdio.h>)
#include <stdio.h>
#else
/* Provide minimal printf/vsnprintf prototypes for host/static analysis */
int printf(const char *format, ...);
int vsnprintf(char *str, size_t size, const char *format, va_list ap);
#endif
#else
#include <stdio.h>
#endif

#if defined(__has_include)
#if __has_include(<string.h>)
#include <string.h>
#else
/* Minimal string functions used by this file */
char *strstr(const char *haystack, const char *needle);
size_t strlen(const char *s);
void *memcpy(void *dest, const void *src, size_t n);
#endif
#else
#include <string.h>
#endif
#if defined(__has_include)
#if __has_include("NuMicro.h")
#include "NuMicro.h"
#else
#include "host_compat.h"
#endif
#else
#include "NuMicro.h"
#endif

#include "ble.h"
#include "system_status.h"
#include "buzzer.h"
#include "led.h"
#include "game_logic.h"
#include "timer.h"

/* Reuse buffer sizes from header */
volatile uint8_t g_u8RecData[RXBUFSIZE] = {0};
volatile uint32_t g_u32RecLen = 0;
volatile uint8_t g_u8DataReady = 0;

/* BLE command enum and table (moved from main.c) */
typedef enum
{
  BLE_CMD_NONE = 0,
  BLE_CMD_CONNECTED,
  BLE_CMD_DISCONNECTED,
  BLE_CMD_CMD_MODE,
  BLE_CMD_DATA_MODE,
  BLE_CMD_CONN_START,
  BLE_CMD_GET_CYCLE,
  BLE_CMD_SET_END,
  BLE_CMD_DISC_MSG,
  BLE_CMD_MAC_ADDR,
  BLE_CMD_DEVICE_NAME
} BleCmdType;

static const struct
{
  BleCmdType type;
  const char *keyword;
} BleCmdTable[] = {
    {BLE_CMD_CONNECTED, ": CONNECTED OK"},
    {BLE_CMD_DISCONNECTED, ": DISCONNECTED OK"},
    {BLE_CMD_CMD_MODE, ": CMD_MODE OK"},
    {BLE_CMD_DATA_MODE, ": DATA_MODE OK"},
    {BLE_CMD_CONN_START, "conn st"},
    {BLE_CMD_GET_CYCLE, "get cycle"},
    {BLE_CMD_SET_END, "set end"},
    {BLE_CMD_DISC_MSG, "disc"},
    {BLE_CMD_MAC_ADDR, "MAC_ADDR"},
    {BLE_CMD_DEVICE_NAME, "DEVICE_NAME"}};

static size_t BLE_TrimLineLen(const char *src, size_t len)
{
  while (len > 0u && (src[len - 1u] == '\r' || src[len - 1u] == '\n'))
  {
    len--;
  }
  return len;
}

static void BLE_CopyClamp(volatile uint8_t *dst, size_t dst_size, const char *src, size_t len)
{
  if (!dst || !src || dst_size == 0u)
  {
    return;
  }

  size_t copy_len = len;
  if (copy_len >= dst_size)
  {
    copy_len = dst_size - 1u;
  }

  memcpy((void *)dst, src, copy_len);
  dst[copy_len] = '\0';
}

BleCmdType BLEParseCommand(const char *msg)
{
  uint8_t i;
  for (i = 0; i < sizeof(BleCmdTable) / sizeof(BleCmdTable[0]); ++i)
  {
    if (strstr(msg, BleCmdTable[i].keyword))
    {
      return BleCmdTable[i].type;
    }
  }
  return BLE_CMD_NONE;
}

extern SystemStatus g_sys; /* defined in system_status.c via system_status.h */

void UART1_IRQHandler(void)
{
  uint8_t u8InChar = 0xFF;
  uint32_t u32IntSts = UART1->INTSTS;

  if (u32IntSts & UART_INTSTS_RDAIF_Msk)
  {
    while (UART_IS_RX_READY(UART1))
    {
      u8InChar = UART_READ(UART1);

      if (u8InChar == '\n')
      {
        g_u8RecData[g_u32RecLen] = '\0';
        g_u8DataReady = 1;
        break;
      }

      g_u8RecData[g_u32RecLen] = u8InChar;
      g_u32RecLen++;
      if (g_u32RecLen >= RXBUFSIZE)
      {
        g_u32RecLen = 0;
      }
    }
  }

  if (u32IntSts & UART_INTSTS_THREIF_Msk)
  {
    UART_DisableInt(UART1, UART_INTEN_THREIEN_Msk);
  }
}

void receiveData(volatile uint8_t **recData)
{
  if (g_u8DataReady)
  {
    *recData = g_u8RecData;
    g_u8DataReady = 0;
    g_u32RecLen = 0;
  }
}

int BLE_UART_SEND(void *uart, const char *format, ...)
{
  uint8_t buf[BUF_SIZE];
  va_list arg;
  int done;

  va_start(arg, format);
  done = vsnprintf((char *)buf, BUF_SIZE, format, arg);
  va_end(arg);

  /* uart is an opaque pointer in the public API; cast back to UART_T* for SDK calls */
  UART_T *u = (UART_T *)uart;
  UART_Write(u, buf, done);
  return done;
}

void CheckBleRecvMsg(void)
{
  volatile uint8_t *pRecData, i;
  volatile uint8_t **ppRecData = &pRecData;
  if (g_u8DataReady)
  {
    receiveData(ppRecData);

#if DEBUG
    printf("[DEBUG] Received: %s\n", pRecData);
#endif

    BleCmdType cmdType = BLEParseCommand((const char *)pRecData);
    switch (cmdType)
    {
    case BLE_CMD_CONNECTED:
      g_sys.ble_state = BLE_CONNECTED;
      /* Reset movement inactivity timer on BLE connect so user hold doesn't
        immediately trigger idle state. */
      Game_ResetMovementTimer();
      Game_ResetBleTimer(); /* Reset BLE send timer on reconnect */
      break;
    case BLE_CMD_DISCONNECTED:
      g_sys.ble_state = BLE_DISCONNECTED;
      g_sys.game_state = GAME_STOP;
      break;
    case BLE_CMD_CMD_MODE:
      g_sys.ble_mode = 0;
      break;
    case BLE_CMD_DATA_MODE:
      g_sys.ble_mode = 1;
      break;
    case BLE_CMD_CONN_START:
      BLE_UART_SEND((void *)UART1, "Connecting\n");
      g_sys.jump_times = 0;
      break;
    case BLE_CMD_GET_CYCLE:
      g_sys.jump_times = 0;
      BLE_UART_SEND((void *)UART1, "Connecting\n");
      BuzzerPlay(2000, 800);
      g_sys.game_state = GAME_START;
      break;
    case BLE_CMD_SET_END:
      g_sys.game_state = GAME_STOP;
      g_sys.jump_times = 0;
      for (i = 0; i < 5; i++)
      {
        BuzzerPlay(1000, 200);
        delay_ms(200);
      }
      break;
    case BLE_CMD_DISC_MSG:
      g_sys.game_state = GAME_STOP;
      g_sys.jump_times = 0;
      break;
    case BLE_CMD_MAC_ADDR:
    {
      size_t len = strlen((const char *)pRecData);
      len = BLE_TrimLineLen((const char *)pRecData, len);
      if (len > 0u)
      {
        BLE_CopyClamp(g_sys.mac_addr, sizeof(g_sys.mac_addr), (const char *)pRecData, len);
      }
    }
    break;
    case BLE_CMD_DEVICE_NAME:
    {
      size_t len = strlen((const char *)pRecData);
      len = BLE_TrimLineLen((const char *)pRecData, len);
      if (len > 0u)
      {
        BLE_CopyClamp(g_sys.device_name, sizeof(g_sys.device_name), (const char *)pRecData, len);
      }
    }
    break;
    case BLE_CMD_NONE:
    default:
      break;
    }
  }
}

void ble_send_cmd(const char *cmd, uint32_t delay)
{
  BLE_UART_SEND((void *)UART1, "%s", cmd);
  delay_ms(delay);
}

void BLE_DISCONNECT()
{
  ble_send_cmd(BLE_CMD_CCMD, 500);
  ble_send_cmd("AT+DISC\r\n", 100);
  ble_send_cmd("AT+MODE_DATA\r\n", 0);
}

void BLE_to_DLPS()
{
  ble_send_cmd(BLE_CMD_CCMD, 200);
  ble_send_cmd(BLE_CMD_ADVERT_OFF, 20);
  ble_send_cmd(BLE_CMD_DLPS_ON, 20);
}

void BLEToRunMode()
{
  ble_send_cmd(BLE_CMD_DLPS_OFF, 100);
  ble_send_cmd(BLE_CMD_ADVERT_ON, 20);
  ble_send_cmd(BLE_CMD_MODE_DATA, 200);
}

void BLEDisconnect()
{
  ble_send_cmd(BLE_CMD_CCMD, 500);
  ble_send_cmd(BLE_CMD_DISC, 100);
  ble_send_cmd(BLE_CMD_MODE_DATA, 100);
}

void BLESetName(const char *name)
{
  BLE_UART_SEND((void *)UART1, "AT+NAME=%s\r\n", name);
  delay_ms(100);
}

void BLESendData(const char *data)
{
  BLE_UART_SEND((void *)UART1, data);
  delay_ms(2);
}

void BleSetup(void)
{
  BLEToRunMode();
}

/* ---- BLE rename flow helpers (moved from main.c) ---- */

static uint8_t Ble_IsHexChar(char c)
{
  return (uint8_t)((c >= '0' && c <= '9') ||
                   (c >= 'A' && c <= 'F') ||
                   (c >= 'a' && c <= 'f'));
}

static uint8_t Ble_ExtractMacSuffix4(const char *src, char *out4)
{
  if (!src || !out4)
  {
    return 0u;
  }

  char hex_buf[16];
  uint8_t hex_len = 0u;
  for (size_t i = 0u; src[i] != '\0'; i++)
  {
    if (Ble_IsHexChar(src[i]))
    {
      if (hex_len < (uint8_t)sizeof(hex_buf))
      {
        hex_buf[hex_len++] = src[i];
      }
    }
  }

  if (hex_len < 4u)
  {
    out4[0] = '\0';
    return 0u;
  }

  out4[0] = hex_buf[hex_len - 4u];
  out4[1] = hex_buf[hex_len - 3u];
  out4[2] = hex_buf[hex_len - 2u];
  out4[3] = hex_buf[hex_len - 1u];
  out4[4] = '\0';
  return 1u;
}

static uint8_t Ble_HasValidRopeSuffix(const char *name)
{
  if (!name)
  {
    return 0u;
  }

  const char *p = strstr(name, "ROPE_");
  if (!p)
  {
    return 0u;
  }

  p += 5; /* skip "ROPE_" */
  for (uint8_t i = 0u; i < 4u; i++)
  {
    if (!Ble_IsHexChar(p[i]))
    {
      return 0u;
    }
  }
  return 1u;
}

void Ble_RenameFlow(uint8_t *device_name, uint8_t *mac)
{
  delay_ms(200);
  BLE_UART_SEND(UART1, BLE_CMD_CCMD);
  delay_ms(200);
  CheckBleRecvMsg();
  BLE_UART_SEND(UART1, BLE_CMD_NAME_QUERY);
  delay_ms(20);
  CheckBleRecvMsg();

  DBG_PRINT("[BLE] name raw: '%s'\r\n", Sys_GetDeviceName());

  memcpy(device_name, (const void *)&Sys_GetDeviceName()[12], 4);
  device_name[4] = '\0';
  DBG_PRINT("name = %s\r\n", device_name);

  uint8_t has_valid_rope = Ble_HasValidRopeSuffix(Sys_GetDeviceName());
  DBG_PRINT("[BLE] rope suffix valid: %u\r\n", has_valid_rope);

  if (!has_valid_rope)
  {
    DBG_PRINT("rename %s\n", device_name);
    BLE_UART_SEND(UART1, BLE_CMD_ADDR_QUERY);
    for (uint8_t retry = 0u; retry < 10u; retry++)
    {
      delay_ms(20);
      CheckBleRecvMsg();
      if (strlen((const char *)Sys_GetMacAddr()) > 0u)
      {
        break;
      }
    }
    DBG_PRINT("[BLE] addr raw: '%s'\n", Sys_GetMacAddr());

    char mac_suffix[5];
    uint8_t has_suffix = Ble_ExtractMacSuffix4(Sys_GetMacAddr(), mac_suffix);
    if (!has_suffix && strlen((const char *)Sys_GetMacAddr()) >= 21u)
    {
      memcpy(mac_suffix, (const void *)&Sys_GetMacAddr()[17], 4);
      mac_suffix[4] = '\0';
      has_suffix = 1u;
    }

    DBG_PRINT("[BLE] mac suffix: '%s' (valid=%u)\n", mac_suffix, has_suffix);

    if (has_suffix)
    {
      memcpy(mac, mac_suffix, 4);
      mac[4] = '\0';
      DBG_PRINT("MAC address: %s \n", mac);
      BLE_UART_SEND(UART1, "AT+NAME=ROPE_%s\r\n", mac);
    }
    else
    {
      DBG_PRINT("[BLE] WARN: MAC suffix not found, skip rename\n");
    }
    delay_ms(500);
    CheckBleRecvMsg();
    BLE_UART_SEND(UART1, BLE_CMD_REBOOT);
    delay_ms(500);
    CheckBleRecvMsg();
  }
  BLE_UART_SEND(UART1, BLE_CMD_MODE_DATA);
  delay_ms(200);
  DBG_PRINT("rename OK\n");
}

void Ble_Init(uint32_t baud)
{
  /* Open UART1 for BLE transport and enable RX interrupt */
  UART_Open(UART1, baud);
  NVIC_EnableIRQ(UART1_IRQn);
  UART_EnableInt(UART1, UART_INTEN_RDAIEN_Msk | UART_INTEN_THREIEN_Msk);
}
